blog/app/controllers/comments_controller.rb

	def create
	    @post = Post.find(params[:post_id])
	    @comment = @post.comments.create(params[:comment])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "sajed sajed sajed sajed"], ["commenter", "sajed"], ["created_at", Thu, 21 Feb 2013 23:00:47 UTC +00:00], ["post_id", 2], ["updated_at", Thu, 21 Feb 2013 23:00:47 UTC +00:00]]

	def destroy
	    @post = Post.find(params[:post_id])
	    @comment = @post.comments.find(params[:id])
	    @comment.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 2 AND "comments"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]