blog/app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("content", "created_at", "name", "title", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "jadfa fahafas daf a"], ["created_at", Thu, 21 Feb 2013 22:29:36 UTC +00:00], ["name", "sajed"], ["title", "my post"], ["updated_at", Thu, 21 Feb 2013 22:29:36 UTC +00:00]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "7"]]
UPDATE "posts" SET "updated_at" = '2013-02-25 18:51:18.083077', "name" = 'test post 2 (edit)', "content" = '

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 1]]